#+OPTIONS: H:2
#+TITLE: Literal Programming Emacs Configure
#+AUTHOR: Jichao Ouyang

*** pandoc
#+BEGIN_SRC emacs-lisp
  (setq org-pandoc-options-for-revealjs '(
                                          (self-contained . t)
(variable . "theme=solarized")
(section-divs . t)
                                          (standalone . nil)))
#+END_SRC

#+RESULTS:
: ((self-contained . t) (variable . theme=solarized) (section-divs . t) (standalone))

** smartparens
#+BEGIN_SRC emacs-lisp
  (require 'smartparens-config)
  (smartparens-global-mode t)

  (show-smartparens-global-mode t)

  (add-hook 'clojure-mode-hook 'turn-on-smartparens-strict-mode)
  (add-hook 'prog-mode-hook 'turn-on-smartparens-strict-mode)
  (add-hook 'markdown-mode-hook 'turn-on-smartparens-strict-mode)
#+END_SRC

#+RESULTS:
| turn-on-smartparens-strict-mode |


** general
#+BEGIN_SRC emacs-lisp 
  (bind-keys
   ("M-c" . kill-ring-save)
   ("C-8" . er/expand-region)
   ("M-8" . er/contract-region)
   ("C-x r" . vr/query-replace)
   ("M--" . text-scale-decrease)
   ("M-=" . text-scale-increase)
   ("C-c i" . (lambda () (interactive) (indent-region (point-min) (point-max))))
   ("M-<backspace>" . kill-whole-line)
   ("C-c r" . revert-buffer)
   ("C-3" . back-button-global-backward)
   ("C-4" . back-button-global-forward)
   ("C-c SPC" . ace-jump-mode)
   ("C-c h d" . howdoi-query-insert-code-snippet-at-point)
   ("M-k" . delete-other-windows)
   ("<f7>" . toggle-window-split)
   ("C-c c" . deft)
   ("C-x t" . org-capture)
   ("C-c a" (lambda () (interactive) (org-agenda nil "n"))))
#+END_SRC  

#+RESULTS:
| lambda | nil | (interactive) | (org-agenda nil n) |

